### Formating tampilan Data Frame

### Import Modul

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

### Persiapan Data Frame

In [2]:
n_rows=5
n_cols=2
cols=['omset','operasional'] #Label Kolom

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
               columns=cols)

df

   omset  operasional
0      1           17
1     12            3
2     16           19
3     10           18
4      2           18

In [3]:
df['omset']=df['omset'] *100_000 #tanda _ pada py sebagai node character 
df['operasional']=df['operasional']*10_000
df

     omset  operasional
0   100000       170000
1  1200000        30000
2  1600000       190000
3  1000000       180000
4   200000       180000

In [6]:
df.index=pd.util.testing.makeDateIndex(n_rows,freq='D')
df=df.reset_index()
df=df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   100000       170000
1 2000-01-02  1200000        30000
2 2000-01-03  1600000       190000
3 2000-01-04  1000000       180000
4 2000-01-05   200000       180000

### Melakukan Formatting tampilan data

In [7]:
formatku={'tanggal':'{:%d/%m/%y}',
         'operasional':'RP {:.2f}',
         'omset ':'Rp {:.2f}'}
laporan=df.style.format(formatku)
laporan

In [8]:
type(laporan)

pandas.io.formats.style.Styler

In [9]:
laporan.hide_index()

In [10]:
laporan.set_caption('Data Omset dan Operasional')

In [11]:
laporan.highlight_min('omset',color='pink')
laporan.highlight_max('omset',color='lightgreen')

laporan.highlight_min('operasional',color='lightblue')
laporan.highlight_max('operasional',color='grey')